sunshine012/Freescale_BM_USB_Stack_v5.0/Src/platform/soc/MKL26Z/MKL26Z4/MKL26Z4_usb.h
/*! @brief Format value for bitfield USB_OTGSTAT_ONEMSECEN. */
#define BF_USB_OTGSTAT_ONEMSECEN(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint8_t) << BP_USB_OTGSTAT_ONEMSECEN), uint8_t) & BM_USB_OTGSTAT_ONEMSECEN)

#ifndef __LANGUAGE_ASM__
/*! @brief Set the ONEMSECEN field to a new value. */
#define BW_USB_OTGSTAT_ONEMSECEN(v) (BME_BFI8(HW_USB_OTGSTAT_ADDR, ((uint8_t)(v) << BP_USB_OTGSTAT_ONEMSECEN), BP_USB_OTGSTAT_ONEMSECEN, 1))
#endif
/*@}*/

/*!
 * @name Register USB_OTGSTAT, field ID[7] (RW)
 *
 * Indicates the current state of the ID pin on the USB connector
 *
 * Values:
 * - 0 - Indicates a Type A cable is plugged into the USB connector.
 * - 1 - Indicates no cable is attached or a Type B cable is plugged into the
 *     USB connector.
 */
/*@{*/
#define BP_USB_OTGSTAT_ID    (7U)          /*!< Bit position for USB_OTGSTAT_ID. */
#define BM_USB_OTGSTAT_ID    (0x80U)       /*!< Bit mask for USB_OTGSTAT_ID. */
#define BS_USB_OTGSTAT_ID    (1U)          /*!< Bit field size in bits for USB_OTGSTAT_ID. */

#ifndef __LANGUAGE_ASM__
/*! @brief Read current value of the USB_OTGSTAT_ID field. */
#define BR_USB_OTGSTAT_ID    (BME_UBFX8(HW_USB_OTGSTAT_ADDR, BP_USB_OTGSTAT_ID, BS_USB_OTGSTAT_ID))
#endif

/*! @brief Format value for bitfield USB_OTGSTAT_ID. */
#define BF_USB_OTGSTAT_ID(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint8_t) << BP_USB_OTGSTAT_ID), uint8_t) & BM_USB_OTGSTAT_ID)

#ifndef __LANGUAGE_ASM__
/*! @brief Set the ID field to a new value. */
#define BW_USB_OTGSTAT_ID(v) (BME_BFI8(HW_USB_OTGSTAT_ADDR, ((uint8_t)(v) << BP_USB_OTGSTAT_ID), BP_USB_OTGSTAT_ID, 1))
#endif
/*@}*/

/*******************************************************************************
 * HW_USB_OTGCTL - OTG Control register
 ******************************************************************************/

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USB_OTGCTL - OTG Control register (RW)
 *
 * Reset value: 0x00U
 *
 * Controls the operation of VBUS and Data Line termination resistors.
 */
typedef union _hw_usb_otgctl
{
    uint8_t U;
    struct _hw_usb_otgctl_bitfields
    {
        uint8_t RESERVED0 : 2;         /*!< [1:0]  */
        uint8_t OTGEN : 1;             /*!< [2] On-The-Go pullup/pulldown resistor enable
                                        * */
        uint8_t RESERVED1 : 1;         /*!< [3]  */
        uint8_t DMLOW : 1;             /*!< [4] D- Data Line pull-down resistor enable */
        uint8_t DPLOW : 1;             /*!< [5] D+ Data Line pull-down resistor enable */
        uint8_t RESERVED2 : 1;         /*!< [6]  */
        uint8_t DPHIGH : 1;            /*!< [7] D+ Data Line pullup resistor enable */
    } B;
} hw_usb_otgctl_t;
#endif

/*!
 * @name Constants and macros for entire USB_OTGCTL register
 */
/*@{*/
#define HW_USB_OTGCTL_ADDR       (REGS_USB_BASE + 0x1CU)

#ifndef __LANGUAGE_ASM__
#define HW_USB_OTGCTL            (*(__IO hw_usb_otgctl_t *) HW_USB_OTGCTL_ADDR)
#define HW_USB_OTGCTL_RD()       (HW_USB_OTGCTL.U)
#define HW_USB_OTGCTL_WR(v)      (HW_USB_OTGCTL.U = (v))
#define HW_USB_OTGCTL_SET(v)     (BME_OR8(HW_USB_OTGCTL_ADDR, (uint8_t)(v)))
#define HW_USB_OTGCTL_CLR(v)     (BME_AND8(HW_USB_OTGCTL_ADDR, (uint8_t)(~(v))))
#define HW_USB_OTGCTL_TOG(v)     (BME_XOR8(HW_USB_OTGCTL_ADDR, (uint8_t)(v)))
#endif
/*@}*/

/*
 * Constants & macros for individual USB_OTGCTL bitfields
 */

/*!
 * @name Register USB_OTGCTL, field OTGEN[2] (RW)
 *
 * Values:
 * - 0 - If USB_EN is 1 and HOST_MODE is 0 in the Control Register (CTL), then
 *     the D+ Data Line pull-up resistors are enabled. If HOST_MODE is 1 the D+
 *     and D- Data Line pull-down resistors are engaged.
 * - 1 - The pull-up and pull-down controls in this register are used.
 */
/*@{*/
#define BP_USB_OTGCTL_OTGEN  (2U)          /*!< Bit position for USB_OTGCTL_OTGEN. */
#define BM_USB_OTGCTL_OTGEN  (0x04U)       /*!< Bit mask for USB_OTGCTL_OTGEN. */
#define BS_USB_OTGCTL_OTGEN  (1U)          /*!< Bit field size in bits for USB_OTGCTL_OTGEN. */

#ifndef __LANGUAGE_ASM__
/*! @brief Read current value of the USB_OTGCTL_OTGEN field. */
#define BR_USB_OTGCTL_OTGEN  (BME_UBFX8(HW_USB_OTGCTL_ADDR, BP_USB_OTGCTL_OTGEN, BS_USB_OTGCTL_OTGEN))
#endif

/*! @brief Format value for bitfield USB_OTGCTL_OTGEN. */
#define BF_USB_OTGCTL_OTGEN(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint8_t) << BP_USB_OTGCTL_OTGEN), uint8_t) & BM_USB_OTGCTL_OTGEN)

#ifndef __LANGUAGE_ASM__
/*! @brief Set the OTGEN field to a new value. */
#define BW_USB_OTGCTL_OTGEN(v) (BME_BFI8(HW_USB_OTGCTL_ADDR, ((uint8_t)(v) << BP_USB_OTGCTL_OTGEN), BP_USB_OTGCTL_OTGEN, 1))
#endif
/*@}*/

/*!
 * @name Register USB_OTGCTL, field DMLOW[4] (RW)
 *
 * Values:
 * - 0 - D- pulldown resistor is not enabled.
 * - 1 - D- pulldown resistor is enabled.
 */
/*@{*/
#define BP_USB_OTGCTL_DMLOW  (4U)          /*!< Bit position for USB_OTGCTL_DMLOW. */
#define BM_USB_OTGCTL_DMLOW  (0x10U)       /*!< Bit mask for USB_OTGCTL_DMLOW. */
#define BS_USB_OTGCTL_DMLOW  (1U)          /*!< Bit field size in bits for USB_OTGCTL_DMLOW. */

#ifndef __LANGUAGE_ASM__
/*! @brief Read current value of the USB_OTGCTL_DMLOW field. */
#define BR_USB_OTGCTL_DMLOW  (BME_UBFX8(HW_USB_OTGCTL_ADDR, BP_USB_OTGCTL_DMLOW, BS_USB_OTGCTL_DMLOW))
#endif

/*! @brief Format value for bitfield USB_OTGCTL_DMLOW. */
#define BF_USB_OTGCTL_DMLOW(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint8_t) << BP_USB_OTGCTL_DMLOW), uint8_t) & BM_USB_OTGCTL_DMLOW)

#ifndef __LANGUAGE_ASM__
/*! @brief Set the DMLOW field to a new value. */
#define BW_USB_OTGCTL_DMLOW(v) (BME_BFI8(HW_USB_OTGCTL_ADDR, ((uint8_t)(v) << BP_USB_OTGCTL_DMLOW), BP_USB_OTGCTL_DMLOW, 1))
#endif
/*@}*/

/*!
 * @name Register USB_OTGCTL, field DPLOW[5] (RW)
 *
 * This bit should always be enabled together with bit 4 (DMLOW)
 *
 * Values:
 * - 0 - D+ pulldown resistor is not enabled.
 * - 1 - D+ pulldown resistor is enabled.
 */
/*@{*/
#define BP_USB_OTGCTL_DPLOW  (5U)          /*!< Bit position for USB_OTGCTL_DPLOW. */
#define BM_USB_OTGCTL_DPLOW  (0x20U)       /*!< Bit mask for USB_OTGCTL_DPLOW. */
#define BS_USB_OTGCTL_DPLOW  (1U)          /*!< Bit field size in bits for USB_OTGCTL_DPLOW. */

#ifndef __LANGUAGE_ASM__
/*! @brief Read current value of the USB_OTGCTL_DPLOW field. */
#define BR_USB_OTGCTL_DPLOW  (BME_UBFX8(HW_USB_OTGCTL_ADDR, BP_USB_OTGCTL_DPLOW, BS_USB_OTGCTL_DPLOW))
#endif

/*! @brief Format value for bitfield USB_OTGCTL_DPLOW. */
#define BF_USB_OTGCTL_DPLOW(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint8_t) << BP_USB_OTGCTL_DPLOW), uint8_t) & BM_USB_OTGCTL_DPLOW)

#ifndef __LANGUAGE_ASM__
/*! @brief Set the DPLOW field to a new value. */
#define BW_USB_OTGCTL_DPLOW(v) (BME_BFI8(HW_USB_OTGCTL_ADDR, ((uint8_t)(v) << BP_USB_OTGCTL_DPLOW), BP_USB_OTGCTL_DPLOW, 1))
#endif
/*@}*/

/*!
 * @name Register USB_OTGCTL, field DPHIGH[7] (RW)
 *
 * Values:
 * - 0 - D+ pullup resistor is not enabled
 * - 1 - D+ pullup resistor is enabled
 */
/*@{*/
#define BP_USB_OTGCTL_DPHIGH (7U)          /*!< Bit position for USB_OTGCTL_DPHIGH. */
#define BM_USB_OTGCTL_DPHIGH (0x80U)       /*!< Bit mask for USB_OTGCTL_DPHIGH. */
#define BS_USB_OTGCTL_DPHIGH (1U)          /*!< Bit field size in bits for USB_OTGCTL_DPHIGH. */

#ifndef __LANGUAGE_ASM__
/*! @brief Read current value of the USB_OTGCTL_DPHIGH field. */
#define BR_USB_OTGCTL_DPHIGH (BME_UBFX8(HW_USB_OTGCTL_ADDR, BP_USB_OTGCTL_DPHIGH, BS_USB_OTGCTL_DPHIGH))
#endif

/*! @brief Format value for bitfield USB_OTGCTL_DPHIGH. */
#define BF_USB_OTGCTL_DPHIGH(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint8_t) << BP_USB_OTGCTL_DPHIGH), uint8_t) & BM_USB_OTGCTL_DPHIGH)

#ifndef __LANGUAGE_ASM__
/*! @brief Set the DPHIGH field to a new value. */
#define BW_USB_OTGCTL_DPHIGH(v) (BME_BFI8(HW_USB_OTGCTL_ADDR, ((uint8_t)(v) << BP_USB_OTGCTL_DPHIGH), BP_USB_OTGCTL_DPHIGH, 1))
#endif
/*@}*/

